Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/resets.h
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_SPI0
#define RESETS_RESET_DONE_SPI0_RESET  _u(0x0)
#define RESETS_RESET_DONE_SPI0_BITS   _u(0x00040000)
#define RESETS_RESET_DONE_SPI0_MSB    _u(18)
#define RESETS_RESET_DONE_SPI0_LSB    _u(18)
#define RESETS_RESET_DONE_SPI0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_SHA256
#define RESETS_RESET_DONE_SHA256_RESET  _u(0x0)
#define RESETS_RESET_DONE_SHA256_BITS   _u(0x00020000)
#define RESETS_RESET_DONE_SHA256_MSB    _u(17)
#define RESETS_RESET_DONE_SHA256_LSB    _u(17)
#define RESETS_RESET_DONE_SHA256_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_PWM
#define RESETS_RESET_DONE_PWM_RESET  _u(0x0)
#define RESETS_RESET_DONE_PWM_BITS   _u(0x00010000)
#define RESETS_RESET_DONE_PWM_MSB    _u(16)
#define RESETS_RESET_DONE_PWM_LSB    _u(16)
#define RESETS_RESET_DONE_PWM_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_PLL_USB
#define RESETS_RESET_DONE_PLL_USB_RESET  _u(0x0)
#define RESETS_RESET_DONE_PLL_USB_BITS   _u(0x00008000)
#define RESETS_RESET_DONE_PLL_USB_MSB    _u(15)
#define RESETS_RESET_DONE_PLL_USB_LSB    _u(15)
#define RESETS_RESET_DONE_PLL_USB_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_PLL_SYS
#define RESETS_RESET_DONE_PLL_SYS_RESET  _u(0x0)
#define RESETS_RESET_DONE_PLL_SYS_BITS   _u(0x00004000)
#define RESETS_RESET_DONE_PLL_SYS_MSB    _u(14)
#define RESETS_RESET_DONE_PLL_SYS_LSB    _u(14)
#define RESETS_RESET_DONE_PLL_SYS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_PIO2
#define RESETS_RESET_DONE_PIO2_RESET  _u(0x0)
#define RESETS_RESET_DONE_PIO2_BITS   _u(0x00002000)
#define RESETS_RESET_DONE_PIO2_MSB    _u(13)
#define RESETS_RESET_DONE_PIO2_LSB    _u(13)
#define RESETS_RESET_DONE_PIO2_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_PIO1
#define RESETS_RESET_DONE_PIO1_RESET  _u(0x0)
#define RESETS_RESET_DONE_PIO1_BITS   _u(0x00001000)
#define RESETS_RESET_DONE_PIO1_MSB    _u(12)
#define RESETS_RESET_DONE_PIO1_LSB    _u(12)
#define RESETS_RESET_DONE_PIO1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_PIO0
#define RESETS_RESET_DONE_PIO0_RESET  _u(0x0)
#define RESETS_RESET_DONE_PIO0_BITS   _u(0x00000800)
#define RESETS_RESET_DONE_PIO0_MSB    _u(11)
#define RESETS_RESET_DONE_PIO0_LSB    _u(11)
#define RESETS_RESET_DONE_PIO0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_PADS_QSPI
#define RESETS_RESET_DONE_PADS_QSPI_RESET  _u(0x0)
#define RESETS_RESET_DONE_PADS_QSPI_BITS   _u(0x00000400)
#define RESETS_RESET_DONE_PADS_QSPI_MSB    _u(10)
#define RESETS_RESET_DONE_PADS_QSPI_LSB    _u(10)
#define RESETS_RESET_DONE_PADS_QSPI_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_PADS_BANK0
#define RESETS_RESET_DONE_PADS_BANK0_RESET  _u(0x0)
#define RESETS_RESET_DONE_PADS_BANK0_BITS   _u(0x00000200)
#define RESETS_RESET_DONE_PADS_BANK0_MSB    _u(9)
#define RESETS_RESET_DONE_PADS_BANK0_LSB    _u(9)
#define RESETS_RESET_DONE_PADS_BANK0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_JTAG
#define RESETS_RESET_DONE_JTAG_RESET  _u(0x0)
#define RESETS_RESET_DONE_JTAG_BITS   _u(0x00000100)
#define RESETS_RESET_DONE_JTAG_MSB    _u(8)
#define RESETS_RESET_DONE_JTAG_LSB    _u(8)
#define RESETS_RESET_DONE_JTAG_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_IO_QSPI
#define RESETS_RESET_DONE_IO_QSPI_RESET  _u(0x0)
#define RESETS_RESET_DONE_IO_QSPI_BITS   _u(0x00000080)
#define RESETS_RESET_DONE_IO_QSPI_MSB    _u(7)
#define RESETS_RESET_DONE_IO_QSPI_LSB    _u(7)
#define RESETS_RESET_DONE_IO_QSPI_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_IO_BANK0
#define RESETS_RESET_DONE_IO_BANK0_RESET  _u(0x0)
#define RESETS_RESET_DONE_IO_BANK0_BITS   _u(0x00000040)
#define RESETS_RESET_DONE_IO_BANK0_MSB    _u(6)
#define RESETS_RESET_DONE_IO_BANK0_LSB    _u(6)
#define RESETS_RESET_DONE_IO_BANK0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_I2C1
#define RESETS_RESET_DONE_I2C1_RESET  _u(0x0)
#define RESETS_RESET_DONE_I2C1_BITS   _u(0x00000020)
#define RESETS_RESET_DONE_I2C1_MSB    _u(5)
#define RESETS_RESET_DONE_I2C1_LSB    _u(5)
#define RESETS_RESET_DONE_I2C1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_I2C0
#define RESETS_RESET_DONE_I2C0_RESET  _u(0x0)
#define RESETS_RESET_DONE_I2C0_BITS   _u(0x00000010)
#define RESETS_RESET_DONE_I2C0_MSB    _u(4)
#define RESETS_RESET_DONE_I2C0_LSB    _u(4)
#define RESETS_RESET_DONE_I2C0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_HSTX
#define RESETS_RESET_DONE_HSTX_RESET  _u(0x0)
#define RESETS_RESET_DONE_HSTX_BITS   _u(0x00000008)
#define RESETS_RESET_DONE_HSTX_MSB    _u(3)
#define RESETS_RESET_DONE_HSTX_LSB    _u(3)
#define RESETS_RESET_DONE_HSTX_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_DMA
#define RESETS_RESET_DONE_DMA_RESET  _u(0x0)
#define RESETS_RESET_DONE_DMA_BITS   _u(0x00000004)
#define RESETS_RESET_DONE_DMA_MSB    _u(2)
#define RESETS_RESET_DONE_DMA_LSB    _u(2)
#define RESETS_RESET_DONE_DMA_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_BUSCTRL
#define RESETS_RESET_DONE_BUSCTRL_RESET  _u(0x0)
#define RESETS_RESET_DONE_BUSCTRL_BITS   _u(0x00000002)
#define RESETS_RESET_DONE_BUSCTRL_MSB    _u(1)
#define RESETS_RESET_DONE_BUSCTRL_LSB    _u(1)
#define RESETS_RESET_DONE_BUSCTRL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : RESETS_RESET_DONE_ADC
#define RESETS_RESET_DONE_ADC_RESET  _u(0x0)
#define RESETS_RESET_DONE_ADC_BITS   _u(0x00000001)
#define RESETS_RESET_DONE_ADC_MSB    _u(0)
#define RESETS_RESET_DONE_ADC_LSB    _u(0)
#define RESETS_RESET_DONE_ADC_ACCESS "RO"
// =============================================================================
#endif // _HARDWARE_REGS_RESETS_H

